'''
happysunday.exe
 flag{7@K3_4_R3S7_0N_sUnD4y}
 程序先将输入进行换表的base64加密
 然后将对比的密文与0x78进行异或，再进行比较
所以将密文再异或一次，再换表解密
Flag: flag{7@K3_4_R3S7_0N_sUnD4y}

'''
crypto = [122, 54, 23, 58, 52, 53, 73, 64, 23, 32, 73, 49, 2, 45, 2, 28, 30, 53, 61, 77, 30, 27, 73, 46, 13, 42, 60, 42,
          77, 45, 2]
baer=''
basemima=''
for i in range(len(crypto)):
    crypto[i] = crypto[i] ^ 0x78
    baer += chr(crypto[i])
print(baer)#密文再异或一次

ascii=[65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77,78, 48, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90,
       97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107,108, 109, 110, 79, 112, 113, 114, 115, 116, 117, 118,
       119, 120, 121, 122, 111, 49, 50, 51, 52, 53, 54, 55,56, 57, 43, 47]
for i in range(len(ascii)):
    basemima += chr(ascii[i])
print(basemima)#换的表

#之后去cyberchef，用换了的表进行解密