from gmpy2 import iroot, invert
from sympy import nextprime
from Crypto.Util.number import long_to_bytes

# 已知的n和c
n= 18826072921234889578474637081048897778355728797526284385444583441690938163070163431393548230106465730354533351381033750701488680218014562092886399669341897020201247560578335350095689962357883
c= 7222277584648479136213595478635210755697340208204462913709671401411689465559318765837941340311790655378486375734989447104766258567597713634616469950506043772603004208978666305323700458642485
e = 65537

# 估算r的值
r_prox = iroot(n, 10)[0]

# 在估算值附近暴力搜索正确的r
for r in range(r_prox - 2000, r_prox + 2000):
    p1 = r ** 5 + r ** 4 - r ** 3 + r ** 2 - r + 2024
    q1 = r ** 5 - r ** 4 + r ** 3 - r ** 2 + r + 2024
    p = nextprime(p1)
    q = nextprime(q1)
    if p * q == n:
        # 计算φ(n)
        phi_n = (p - 1) * (q - 1)
        # 计算私钥d
        d = invert(e, phi_n)
        # 解密得到明文m
        m = pow(c, d, n)
        # 将m转换为字节串得到flag
        flag = long_to_bytes(m)
        print(flag)
        break